tutorials/pM4F-Benchmarks/case1/calciteDiss_ThermEqPap/test/constant/CalciteDiss_ThermoEq.op
      dist_x	        time	          pH	          Cl	          Ca	        C(4)	     calcite	   d_calcite	
           0	           0	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.005	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.015	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.025	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.035	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.045	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.055	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.065	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.075	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.085	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.095	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.105	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	 ---------------------------------
End of Run after 116.703 Seconds.
---------------------------------

	  2.0310e+00	  0.0000e+00	
       0.125	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.135	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.145	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.155	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.165	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.175	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.185	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.195	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.205	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.215	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.225	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.235	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.245	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.255	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.265	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.275	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.285	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.295	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.305	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.315	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.325	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.335	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.345	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.355	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.365	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.375	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.385	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.395	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.405	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.415	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.425	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.435	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.445	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.455	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.465	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.475	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.485	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
       0.495	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  2.0310e+00	  0.0000e+00	
         0.5	           0	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	
           0	         600	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.005	         600	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.015	         600	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.025	         600	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.035	         600	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.045	         600	           2	  1.0985e-02	  2.0399e-23	  2.0116e-23	  0.0000e+00	  0.0000e+00	
       0.055	         600	     2.00666	  1.0985e-02	  8.2079e-05	  8.2079e-05	  0.0000e+00	  0.0000e+00	
       0.065	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  1.9591e+00	 -8.2046e-03	
       0.075	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.085	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.095	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.105	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.115	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.125	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.135	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.145	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.155	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.165	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	 -1.4655e-14	
       0.175	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  3.9080e-14	
       0.185	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  8.4377e-15	
       0.195	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	 -5.3291e-15	
       0.205	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	 -1.1990e-14	
       0.215	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  3.2419e-14	
       0.225	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  1.3323e-15	
       0.235	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	 -8.8818e-16	
       0.245	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.255	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.265	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.275	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.285	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	 -1.3767e-14	
       0.295	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  2.0872e-14	
       0.305	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.315	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.325	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.335	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.345	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.355	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  1.5099e-14	
       0.365	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	 -1.5987e-14	
       0.375	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.385	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.395	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	 -2.9754e-14	
       0.405	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  1.4211e-14	
       0.415	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.425	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.435	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.445	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.455	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.465	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.475	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.485	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
       0.495	         600	     6.55179	  1.0985e-02	  8.2042e-03	  8.2042e-03	  2.0310e+00	  0.0000e+00	
         0.5	         600	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	
           0	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.005	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.015	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.025	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.035	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.045	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.055	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
       0.065	        1200	           2	  1.0985e-02	  0.0000e+00	  0.0000e+00	  0.0000e+00	  0.0000e+00	
...
         0.5	        3600	     8.24649	  1.0000e-15	  5.1279e-04	  1.0209e-03	  0.0000e+00	  0.0000e+00	
